; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	spectrograph2 - mode
	spectrograph1 - mode
	thermograph0 - mode
	infrared3 - mode
	Star0 - direction
	Star2 - direction
	GroundStation5 - direction
	GroundStation4 - direction
	Star3 - direction
	Star1 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon6)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 Star3)
	(supports instrument3 thermograph0)
	(supports instrument3 spectrograph2)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star1)
	(supports instrument4 infrared3)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 Star3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
)
(:goal (and
	(pointing satellite1 Star7)
	(have_image Phenomenon6 infrared3)
	(have_image Star7 spectrograph2)
	(have_image Planet8 thermograph0)
	(have_image Star9 spectrograph1)
	(have_image Phenomenon10 infrared3)
	(have_image Phenomenon11 spectrograph2)
	(have_image Planet12 spectrograph1)
	(have_image Phenomenon13 spectrograph2)
	(have_image Star14 infrared3)
	(have_image Phenomenon15 thermograph0)
	(have_image Star16 spectrograph1)
))

)

; plan
1. (turn_to satellite1 groundstation4 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 12
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 12
3. (calibrate satellite1 instrument2 groundstation4)
   added: (calibrated instrument2)
   goals met: 0 of 12
4. (turn_to satellite1 star14 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star14)
   goals met: 0 of 12
5. (take_image satellite1 star14 instrument2 infrared3)
   added: (have_image star14 infrared3)
   goals met: 1 of 12
6. (turn_to satellite1 phenomenon6 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 phenomenon6)
   goals met: 1 of 12
7. (take_image satellite1 phenomenon6 instrument2 infrared3)
   added: (have_image phenomenon6 infrared3)
   goals met: 2 of 12
8. (turn_to satellite1 phenomenon10 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 12
9. (take_image satellite1 phenomenon10 instrument2 infrared3)
   added: (have_image phenomenon10 infrared3)
   goals met: 3 of 12
10. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 3 of 12
11. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 3 of 12
12. (turn_to satellite1 star1 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star1)
   goals met: 3 of 12
13. (calibrate satellite1 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 3 of 12
14. (turn_to satellite1 phenomenon11 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon11)
   goals met: 3 of 12
15. (take_image satellite1 phenomenon11 instrument3 spectrograph2)
   added: (have_image phenomenon11 spectrograph2)
   goals met: 4 of 12
16. (turn_to satellite1 phenomenon13 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon13)
   goals met: 4 of 12
17. (take_image satellite1 phenomenon13 instrument3 spectrograph2)
   added: (have_image phenomenon13 spectrograph2)
   goals met: 5 of 12
18. (turn_to satellite1 phenomenon15 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon15)
   goals met: 5 of 12
19. (take_image satellite1 phenomenon15 instrument3 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 6 of 12
20. (turn_to satellite1 planet12 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 planet12)
   goals met: 6 of 12
21. (take_image satellite1 planet12 instrument3 spectrograph1)
   added: (have_image planet12 spectrograph1)
   goals met: 7 of 12
22. (turn_to satellite1 planet8 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet8)
   goals met: 7 of 12
23. (take_image satellite1 planet8 instrument3 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 8 of 12
24. (turn_to satellite1 star16 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star16)
   goals met: 8 of 12
25. (take_image satellite1 star16 instrument3 spectrograph1)
   added: (have_image star16 spectrograph1)
   goals met: 9 of 12
26. (turn_to satellite1 star9 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star9)
   goals met: 9 of 12
27. (take_image satellite1 star9 instrument3 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 10 of 12
28. (turn_to satellite1 star7 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star7)
   goals met: 11 of 12
29. (take_image satellite1 star7 instrument3 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 12 of 12
